app/Controllers/DashboardController.php

    public function index()
    {
        $pelangganModel = new PelangganModel();
        $produkModel = new ProdukModel();
        $kategoriModel = new KategoriModel();
        $pesananModel = new PesananModel();
        $pembayaranModel = new PembayaranModel();

        $data = [
            'jumlah_pelanggan' => $pelangganModel->countAll(),
            'jumlah_produk' => $produkModel->countAll(),
            'jumlah_kategori' => $kategoriModel->countAll(),
            'jumlah_pesanan' => $pesananModel->countAll(),
            'jumlah_pembayaran' => $pembayaranModel->countAll(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `pelanggan`
SELECT COUNT(*) AS `numrows` FROM `produk`
SELECT COUNT(*) AS `numrows` FROM `kategori`
SELECT COUNT(*) AS `numrows` FROM `pesanan`
SELECT COUNT(*) AS `numrows` FROM `pembayaran`