app/Models/pesananModel.php

SELECT `id_pesanan` as `id_pesanan`, `pesanan`.`waktu_pesanan`, `pesanan`.`total`, `pelanggan`.`nama`, `meja`.`nomor_meja`, `pesanan`.`status`
FROM `pesanan`
JOIN `pelanggan` ON `pelanggan`.`id` = `pesanan`.`pelanggan_id`
JOIN `meja` ON `meja`.`id` = `pesanan`.`meja_id`
---
    public function getAllPesanan()
    {
        return $this->select('id_pesanan as id_pesanan, pesanan.waktu_pesanan, pesanan.total,
                          pelanggan.nama, meja.nomor_meja, pesanan.status')
            ->join('pelanggan', 'pelanggan.id = pesanan.pelanggan_id')
            ->join('meja', 'meja.id = pesanan.meja_id')
            ->findAll();